tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf2321_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF2321_H_
#define _PIC18LF2321_H_

#define PORTA                         0
#define AN0                           1
#define ULPWUIN                       2
#define PORTA_RA0                     3
#define C1N                           4
#define AN1                           5
#define PORTA_RA1                     6
#define C2N                           7
#define AN2                           8
#define C2P                           9
#define PORTA_RA2                     10
#define CVREF                         11
#define VREFM                         12
#define AN3                           13
#define PORTA_RA3                     14
#define VREFP                         15
#define C1P                           16
#define PORTA_RA4                     17
#define PORTA_C1OUT                   18
#define T0CKI                         19
#define PORTA_C2OUT                   20
#define AN4                           21
#define PORTA_RA5                     22
#define NOT_SS                        23
#define LVDIN                         24
#define nSS                           25
#define HLVDIN                        26
#define CLKO                          27
#define PORTA_RA6                     28
#define OSC2                          29
#define CLKI                          30
#define PORTA_RA7                     31
#define OSC1                          32
#define RJPU                          33
#define PORTB                         34
#define FLT0                          35
#define INT0                          36
#define PORTB_RB0                     37
#define AN12                          38
#define INT1                          39
#define PORTB_RB1                     40
#define AN10                          41
#define AN8                           42
#define INT2                          43
#define PORTB_RB2                     44
#define AN9                           45
#define PORTB_CCP2                    46
#define CCP2_PA2                      47
#define PORTB_RB3                     48
#define KBI0                          49
#define PORTB_RB4                     50
#define AN11                          51
#define PGM                           52
#define PORTB_RB5                     53
#define KBI1                          54
#define PGC                           55
#define PORTB_RB6                     56
#define KBI2                          57
#define PGD                           58
#define PORTB_RB7                     59
#define KBI3                          60
#define PORTC                         61
#define T13CKI                        62
#define T1CKI                         63
#define T1OSO                         64
#define PORTC_RC0                     65
#define PORTC_CCP2                    66
#define T1OSI                         67
#define PA2                           68
#define PORTC_RC1                     69
#define CCP1                          70
#define P1A                           71
#define PA1                           72
#define PORTC_RC2                     73
#define SCL                           74
#define SCK                           75
#define PORTC_RC3                     76
#define SDA                           77
#define SDI                           78
#define PORTC_RC4                     79
#define SDO                           80
#define PORTC_RC5                     81
#define TX                            82
#define CK                            83
#define PORTC_RC6                     84
#define DT                            85
#define RX                            86
#define PORTC_RC7                     87
#define PORTE                         88
#define VPP                           89
#define RE3                           90
#define NOT_MCLR                      91
#define MCLR                          92
#define CCP9E                         93
#define nMCLR                         94
#define PC3E                          95
#define LATA                          96
#define LATA0                         97
#define LA0                           98
#define LATA1                         99
#define LA1                           100
#define LATA2                         101
#define LA2                           102
#define LATA3                         103
#define LA3                           104
#define LATA4                         105
#define LA4                           106
#define LATA5                         107
#define LA5                           108
#define LATA6                         109
#define LA6                           110
#define LATA7                         111
#define LA7                           112
#define LATB                          113
#define LB0                           114
#define LATB0                         115
#define LB1                           116
#define LATB1                         117
#define LB2                           118
#define LATB2                         119
#define LB3                           120
#define LATB3                         121
#define LB4                           122
#define LATB4                         123
#define LB5                           124
#define LATB5                         125
#define LB6                           126
#define LATB6                         127
#define LB7                           128
#define LATB7                         129
#define LATC                          130
#define LATC0                         131
#define LC0                           132
#define LATC1                         133
#define LC1                           134
#define LATC2                         135
#define LC2                           136
#define LATC3                         137
#define LC3                           138
#define LATC4                         139
#define LC4                           140
#define LATC5                         141
#define LC5                           142
#define LATC6                         143
#define LC6                           144
#define LATC7                         145
#define LC7                           146
#define TRISA                         147
#define TRISA0                        148
#define TRISA_RA0                     149
#define TRISA1                        150
#define TRISA_RA1                     151
#define TRISA2                        152
#define TRISA_RA2                     153
#define TRISA3                        154
#define TRISA_RA3                     155
#define TRISA_RA4                     156
#define TRISA4                        157
#define TRISA_RA5                     158
#define TRISA5                        159
#define TRISA_RA6                     160
#define TRISA6                        161
#define TRISA_RA7                     162
#define TRISA7                        163
#define TRISB                         164
#define TRISB_RB0                     165
#define TRISB0                        166
#define TRISB_RB1                     167
#define TRISB1                        168
#define TRISB_RB2                     169
#define TRISB2                        170
#define TRISB_RB3                     171
#define TRISB3                        172
#define TRISB_RB4                     173
#define TRISB4                        174
#define TRISB_RB5                     175
#define TRISB5                        176
#define TRISB_RB6                     177
#define TRISB6                        178
#define TRISB_RB7                     179
#define TRISB7                        180
#define TRISC                         181
#define TRISC0                        182
#define TRISC_RC0                     183
#define TRISC1                        184
#define TRISC_RC1                     185
#define TRISC2                        186
#define TRISC_RC2                     187
#define TRISC3                        188
#define TRISC_RC3                     189
#define TRISC4                        190
#define TRISC_RC4                     191
#define TRISC5                        192
#define TRISC_RC5                     193
#define TRISC6                        194
#define TRISC_RC6                     195
#define TRISC7                        196
#define TRISC_RC7                     197
#define OSCTUNE                       198
#define TUN0                          199
#define TUN                           200
#define TUN1                          201
#define TUN2                          202
#define TUN3                          203
#define TUN4                          204
#define PLLEN                         205
#define INTSRC                        206
#define PIE1                          207
#define TMR1IE                        208
#define TMR2IE                        209
#define CCP1IE                        210
#define SSPIE                         211
#define TXIE                          212
#define TX1IE                         213
#define RCIE                          214
#define RC1IE                         215
#define ADIE                          216
#define PIR1                          217
#define TMR1IF                        218
#define TMR2IF                        219
#define CCP1IF                        220
#define SSPIF                         221
#define TXIF                          222
#define TX1IF                         223
#define RCIF                          224
#define RC1IF                         225
#define ADIF                          226
#define IPR1                          227
#define TMR1IP                        228
#define TMR2IP                        229
#define CCP1IP                        230
#define SSPIP                         231
#define TX1IP                         232
#define TXIP                          233
#define RC1IP                         234
#define RCIP                          235
#define ADIP                          236
#define PIE2                          237
#define CCP2IE                        238
#define TMR3IE                        239
#define HLVDIE                        240
#define LVDIE                         241
#define BCLIE                         242
#define EEIE                          243
#define CMIE                          244
#define OSCFIE                        245
#define PIR2                          246
#define CCP2IF                        247
#define TMR3IF                        248
#define HLVDIF                        249
#define LVDIF                         250
#define BCLIF                         251
#define EEIF                          252
#define CMIF                          253
#define OSCFIF                        254
#define IPR2                          255
#define CCP2IP                        256
#define TMR3IP                        257
#define HLVDIP                        258
#define LVDIP                         259
#define BCLIP                         260
#define EEIP                          261
#define CMIP                          262
#define OSCFIP                        263
#define EECON1                        264
#define RD                            265
#define WR                            266
#define WREN                          267
#define WRERR                         268
#define FREE                          269
#define CFGS                          270
#define EEFS                          271
#define EEPGD                         272
#define RCSTA                         273
#define RCD8                          274
#define RX9D                          275
#define OERR                          276
#define FERR                          277
#define ADDEN                         278
#define ADEN                          279
#define CREN                          280
#define SRENA                         281
#define SREN                          282
#define RC9                           283
#define RC8_9                         284
#define RX9                           285
#define SPEN                          286
#define TXSTA                         287
#define TXD8                          288
#define TX9D1                         289
#define TX9D                          290
#define TRMT                          291
#define TRMT1                         292
#define BRGH1                         293
#define BRGH                          294
#define SENDB1                        295
#define SENDB                         296
#define SYNC                          297
#define SYNC1                         298
#define TXEN1                         299
#define TXEN                          300
#define TX91                          301
#define TX8_9                         302
#define TX9                           303
#define CSRC1                         304
#define CSRC                          305
#define T3CON                         306
#define TMR3ON                        307
#define TMR3CS                        308
#define nT3SYNC                       309
#define NOT_T3SYNC                    310
#define T3SYNC                        311
#define SOSCEN3                       312
#define T3CCP1                        313
#define T3CKPS                        314
#define T3CKPS0                       315
#define T3CKPS1                       316
#define T3CCP2                        317
#define T3CON_RD16                    318
#define RD163                         319
#define T3RD16                        320
#define CMCON                         321
#define CM                            322
#define CMEN0                         323
#define CM0                           324
#define CMEN1                         325
#define CM1                           326
#define CMEN2                         327
#define CM2                           328
#define CIS                           329
#define C1INV                         330
#define C2INV                         331
#define CMCON_C1OUT                   332
#define CMCON_C2OUT                   333
#define CVRCON                        334
#define CVR                           335
#define CVR0                          336
#define CVR1                          337
#define CVR2                          338
#define CVR3                          339
#define CVRSS                         340
#define CVRR                          341
#define CVROEN                        342
#define CVROE                         343
#define CVREN                         344
#define ECCP1AS                       345
#define PSSAC                         346
#define PSSAC0                        347
#define PSSAC1                        348
#define ECCPAS0                       349
#define ECCPAS                        350
#define ECCPAS1                       351
#define ECCPAS2                       352
#define ECCPASE                       353
#define ECCP1DEL                      354
#define PRSEN                         355
#define BAUDCON                       356
#define ABDEN                         357
#define W4E                           358
#define WUE                           359
#define BRG16                         360
#define TXCKP                         361
#define SCKP                          362
#define RXCKP                         363
#define RXDTP                         364
#define RCMT                          365
#define RCIDL                         366
#define ABDOVF                        367
#define CCP2CON                       368
#define CCP2M                         369
#define CCP2M0                        370
#define CCP2M1                        371
#define CCP2M2                        372
#define CCP2M3                        373
#define DC2B0                         374
#define CCP2Y                         375
#define DC2B                          376
#define DC2B1                         377
#define CCP2X                         378
#define CCP1CON                       379
#define CCP1M0                        380
#define CCP1M                         381
#define CCP1M1                        382
#define CCP1M2                        383
#define CCP1M3                        384
#define CCP1Y                         385
#define DC1B                          386
#define DC1B0                         387
#define CCP1X                         388
#define DC1B1                         389
#define ADCON2                        390
#define ADCS0                         391
#define ADCS                          392
#define ADCS1                         393
#define ADCS2                         394
#define ACQT0                         395
#define ACQT                          396
#define ACQT1                         397
#define ACQT2                         398
#define ADFM                          399
#define ADCON1                        400
#define PCFG0                         401
#define PCFG                          402
#define PCFG1                         403
#define PCFG2                         404
#define CHSN3                         405
#define PCFG3                         406
#define VCFG                          407
#define VCFG0                         408
#define VCFG01                        409
#define VCFG11                        410
#define VCFG1                         411
#define ADCON0                        412
#define ADON                          413
#define nDONE                         414
#define GO_nDONE                      415
#define NOT_DONE                      416
#define GODONE                        417
#define GO_DONE                       418
#define DONE                          419
#define GO_NOT_DONE                   420
#define GO                            421
#define CHS                           422
#define CHS0                          423
#define CHS1                          424
#define CHS2                          425
#define CHS3                          426
#define SSPCON2                       427
#define SEN                           428
#define RSEN                          429
#define ADMSK1                        430
#define PEN                           431
#define ADMSK2                        432
#define RCEN                          433
#define ADMSK3                        434
#define ACKEN                         435
#define ADMSK4                        436
#define ADMSK5                        437
#define ACKDT                         438
#define ACKSTAT                       439
#define GCEN                          440
#define SSPCON1                       441
#define SSPM0                         442
#define SSPM                          443
#define SSPM1                         444
#define SSPM2                         445
#define SSPM3                         446
#define CKP                           447
#define SSPEN                         448
#define SSPOV                         449
#define WCOL                          450
#define SSPSTAT                       451
#define BF                            452
#define UA                            453
#define R_NOT_W                       454
#define NOT_W                         455
#define nW                            456
#define RW                            457
#define nWRITE                        458
#define R                             459
#define W                             460
#define NOT_WRITE                     461
#define R_nW                          462
#define R_W                           463
#define START                         464
#define S                             465
#define STOP                          466
#define P                             467
#define A                             468
#define NOT_A                         469
#define nA                            470
#define D_A                           471
#define D_nA                          472
#define D                             473
#define DA                            474
#define D_NOT_A                       475
#define NOT_ADDRESS                   476
#define nADDRESS                      477
#define CKE                           478
#define SMP                           479
#define T2CON                         480
#define T2CKPS0                       481
#define T2CKPS                        482
#define T2CKPS1                       483
#define TMR2ON                        484
#define T2OUTPS0                      485
#define TOUTPS0                       486
#define TOUTPS                        487
#define T2OUTPS1                      488
#define TOUTPS1                       489
#define T2OUTPS2                      490
#define TOUTPS2                       491
#define T2OUTPS3                      492
#define TOUTPS3                       493
#define PR2                           494
#define WM0                           495
#define WM1                           496
#define WAIT0                         497
#define WAIT1                         498
#define EBDIS                         499
#define T1CON                         500
#define TMR1ON                        501
#define TMR1CS                        502
#define NOT_T1SYNC                    503
#define T1SYNC                        504
#define nT1SYNC                       505
#define T1OSCEN                       506
#define SOSCEN                        507
#define T1CKPS0                       508
#define T1CKPS                        509
#define T1CKPS1                       510
#define T1RUN                         511
#define T1CON_RD16                    512
#define T1RD16                        513
#define RCON                          514
#define BOR                           515
#define NOT_BOR                       516
#define nBOR                          517
#define POR                           518
#define nPOR                          519
#define NOT_POR                       520
#define nPD                           521
